fn-manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-14 Tue 03:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fn Programming Language Manual (pre-0.1)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jack Pugmire" />
</head>
<body>
<div id="content">
<h1 class="title">Fn Programming Language Manual (pre-0.1)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0a52cbd">1. Introduction</a></li>
<li><a href="#orgc73ccad">2. Language Reference</a>
<ul>
<li><a href="#org29f8b9e">2.1. Variables and Mutation</a>
<ul>
<li><a href="#orgf2c853c">2.1.1. Local Variables</a></li>
<li><a href="#orgdf63fbd">2.1.2. Global Variables</a></li>
</ul>
</li>
<li><a href="#orgdf1255b">2.2. Data Types</a>
<ul>
<li><a href="#org943233a">2.2.1. Simple Data Types</a></li>
<li><a href="#org61ef213">2.2.2. Lists</a></li>
<li><a href="#org2cca2ab">2.2.3. Tables</a></li>
<li><a href="#orgf7b37f7">2.2.4. Quoting</a></li>
</ul>
</li>
<li><a href="#orgf0f7143">2.3. <span class="todo TODO">TODO</span> Control Flow and Functions</a>
<ul>
<li><a href="#org0ed65bc">2.3.1. <span class="todo TODO">TODO</span> Conditional Execution</a></li>
<li><a href="#org86219ad">2.3.2. Functions and Calls</a></li>
<li><a href="#org9f8e36f">2.3.3. Variable Capture</a></li>
<li><a href="#orgabb132d">2.3.4. <span class="todo TODO">TODO</span> <code>apply</code></a></li>
<li><a href="#org2969df2">2.3.5. <span class="todo TODO">TODO</span> dollar-fn</a></li>
</ul>
</li>
<li><a href="#orge744e73">2.4. Namespaces and Import</a>
<ul>
<li><a href="#org9236925">2.4.1. Import</a></li>
<li><a href="#org0dda6be">2.4.2. Package Declarations</a></li>
<li><a href="#org3775542">2.4.3. Global Identifiers for Definitions</a></li>
<li><a href="#org916f1a3">2.4.4. Locating Namespace Sources</a></li>
</ul>
</li>
<li><a href="#org2f80de1">2.5. <span class="todo TODO">TODO</span> Macros</a>
<ul>
<li><a href="#org90c1ccb">2.5.1. Macro Basics</a></li>
<li><a href="#org761cf21">2.5.2. Quasiquotation</a></li>
<li><a href="#org9b6b88c">2.5.3. Variable Capture and <code>gensym</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org344888c">3. Command Line Interface</a>
<ul>
<li><a href="#org886d80d">3.1. Invocation and Namespace Determination</a></li>
<li><a href="#org6af3803">3.2. Import Search</a></li>
<li><a href="#orgafae78b">3.3. REPL</a></li>
</ul>
</li>
<li><a href="#org990e8be">4. Builtin Functions</a>
<ul>
<li><a href="#org6e9445e">4.1. <code>fn/builtin</code></a></li>
</ul>
</li>
<li><a href="#org53313c3">5. FFI</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0a52cbd" class="outline-2">
<h2 id="org0a52cbd"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the official manual for Fn. It is not a <i>guide</i> in the sense that it does
not attempt to teach Fn in a linear fashion. However, there should be enough
here for any experienced programmer to get started.
</p>

<p>
Section <a href="#orgc73ccad">2</a> contains a description of all the major features of
the Fn language.
</p>

<p>
Section <a href="#org344888c">3</a> gives instructions on using the <code>fn</code> command line
tool to evaluate code.
</p>

<p>
Section <a href="#org990e8be">4</a> contains a list of builtin functions. This section is
mostly unwritten.
</p>

<p>
Upcoming section <a href="#org53313c3">5</a> details how to interface with C code from Fn.
</p>
</div>
</div>


<div id="outline-container-orgc73ccad" class="outline-2">
<h2 id="orgc73ccad"><span class="section-number-2">2</span> Language Reference</h2>
<div class="outline-text-2" id="text-2">
<p>
Fn is a dynamically typed, garbage-collected, general-purpose programming
language with Lisp-like syntax. A couple of its defining characteristics are:
</p>
<ul class="org-ul">
<li>The core language has relatively few operators, with special care taken to
ensure they have consistent and concise syntax.</li>
<li>Fn is designed for a "mostly functional" programming style, where immutability
and referential transparency are favored, but not required.</li>
<li>The native macro system allows definition of new syntax (and even entire
domain-specific languages) using regular Fn code and data structures.</li>
</ul>

<p>
The syntax looks like this:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> sqrt-precision 0.001<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> approx-sqrt <span style="color: #7388d6;">(</span>x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">letfn</span> <span style="color: #cd9b1d;">iterate</span> <span style="color: #909183;">(</span>guess<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #709870;">(</span>&lt; <span style="color: #907373;">(</span>abs <span style="color: #6276ba;">(</span>- x <span style="color: #858580;">(</span>* guess guess<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> sqrt-precision<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        guess
        <span style="color: #709870;">(</span>iterate <span style="color: #907373;">(</span>/ <span style="color: #6276ba;">(</span>+ guess <span style="color: #858580;">(</span>/ x guess<span style="color: #858580;">)</span> 2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #909183;">(</span>&gt;= x 0<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>iterate <span style="color: #709870;">(</span>/ x 2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b7355;">"Cannot approximate square root of a negative number."</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>


<div id="outline-container-org29f8b9e" class="outline-3">
<h3 id="org29f8b9e"><span class="section-number-3">2.1</span> Variables and Mutation</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgf2c853c" class="outline-4">
<h4 id="orgf2c853c"><span class="section-number-4">2.1.1</span> Local Variables</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Local variables can be created using one of the special operators <code>let</code>, <code>letfn</code>, or
<code>with</code>.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> They all bind variables in the same way, but with
different syntax for programmer convenience. Function parameters are also
treated as local variables within the function body.
</p>

<p>
Before proceeding, we note that the full story about local variables involves
variable capture semantics, which are covered in a later section. Variable
capture doesn't affect any of the concepts discussed in the rest of this section.
</p>

<p>
<code>let</code> is the most elementary way to create a local variable. It defines one or
more new variables in the current lexical environment.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; let binds variables to the given values</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">let</span> x <span style="color: #2aa198; font-weight: bold;">'symbol</span><span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">;; multiple definitions can be made in a single let</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">let</span> a 16
     b <span style="color: #7388d6;">(</span>reverse <span style="color: #8b7355;">"string"</span><span style="color: #7388d6;">)</span>
     <span style="color: #586e75; font-style: italic;">;; value expressions can refer to variables from earlier in the same let</span>
     c <span style="color: #7388d6;">(</span>+ a <span style="color: #909183;">(</span>length b<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
</pre>
</div>

<p>
<code>with</code> is similar to <code>let</code>, but rather than creating definitions in the containing
environment, it creates a new lexical environment.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; this creates two variables</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">with</span> <span style="color: #7388d6;">(</span>a 3
       b 4<span style="color: #7388d6;">)</span>
  <span style="color: #586e75; font-style: italic;">;; the body can contain multiple expressions</span>
  <span style="color: #7388d6;">(</span>println <span style="color: #8b7355;">"hello"</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>+ a b<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">;; returns 7</span>
<span style="color: #586e75; font-style: italic;">;; the variables a, b do not exist outside of the with body</span>
</pre>
</div>

<p>
<code>letfn</code> has a streamlined syntax for creating functions, but otherwise behaves
like <code>let</code>. See the documentation below for details.
</p>

<p>
All local variables can have their value changed with <code>set!</code>. The exclamation
point is because mutation is not to be taken lightly. The syntax for <code>set!</code> is
like this:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">set!</span> var-name new-value<span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">;; for example</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">let</span> var <span style="color: #2aa198; font-weight: bold;">'hi</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>println var<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; prints 'hi</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">set!</span> var <span style="color: #2aa198; font-weight: bold;">'lo</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>println var<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; prints 'lo</span>
</pre>
</div>

<p>
Note that attempting to <code>set!</code> a global variable will result in an error.
</p>
</div>
</div>
