fn-manual.html


<div id="outline-container-org2cca2ab" class="outline-4">
<h4 id="org2cca2ab"><span class="section-number-4">2.2.3</span> Tables</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Tables are key-value stores. Any type of object may be used as a key or a value,
(note, however, that it takes longer to hash more complicated data structures
since we have to descend on their fields)<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<p>
Tables are built using braces <code>{}</code> or the equivalent <code>Table</code> function. This must be
passed an even number of arguments.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">{}</span> <span style="color: #586e75; font-style: italic;">;=&gt; empty table</span>
<span style="color: #707183;">{</span><span style="color: #2aa198; font-weight: bold;">'key1</span> 4 <span style="color: #2aa198; font-weight: bold;">'key</span> 6<span style="color: #707183;">}</span> <span style="color: #586e75; font-style: italic;">;=&gt; table with two kv-pairs</span>
<span style="color: #707183;">(</span><span style="color: #00688b;">Table</span> <span style="color: #2aa198; font-weight: bold;">'key1</span> 4 <span style="color: #2aa198; font-weight: bold;">'key</span> 6<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; table with two kv-pairs</span>
</pre>
</div>

<p>
Table elements may be accessed using the builtin function <code>get</code>. When the key is a
constant symbol, dot syntax (or the equivalent <code>dot</code> special operator) can be
used instead. This is how this looks:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> tab1 <span style="color: #7388d6;">{</span><span style="color: #2aa198; font-weight: bold;">'name</span> <span style="color: #8b7355;">"Mr. Table"</span>
          <span style="color: #2aa198; font-weight: bold;">'occupation</span> <span style="color: #8b7355;">"Holds data"</span>
          <span style="color: #2aa198; font-weight: bold;">'child</span> <span style="color: #909183;">{</span><span style="color: #2aa198; font-weight: bold;">'name</span> <span style="color: #8b7355;">"Table Jr."</span> 
                  <span style="color: #2aa198; font-weight: bold;">'occupation</span> <span style="color: #8b7355;">"Holds less data"</span><span style="color: #909183;">}</span><span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> tab2 <span style="color: #7388d6;">{</span>0 <span style="color: #2aa198; font-weight: bold;">'zero</span> 1 <span style="color: #2aa198; font-weight: bold;">'one</span> 2 <span style="color: #2aa198; font-weight: bold;">'two</span> 3 <span style="color: #2aa198; font-weight: bold;">'three</span> 4 <span style="color: #2aa198; font-weight: bold;">'four</span><span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>

<span style="color: #586e75; font-style: italic;">;; these all return "Mr. Table"</span>
<span style="color: #707183;">(</span>get tab1 <span style="color: #2aa198; font-weight: bold;">'name</span><span style="color: #707183;">)</span>
tab1.name
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">dot</span> tab1 name<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; equivalent syntax to the dot expression</span>
<span style="color: #586e75; font-style: italic;">;; Note that the symbols in the dot expressions are unquoted. Arguments to dot </span>
<span style="color: #586e75; font-style: italic;">;; must be unquoted symbols or a compilation error occurs.</span>

<span style="color: #586e75; font-style: italic;">;; get is more flexible than dot and allows arbitrary key and value expressions</span>
<span style="color: #707183;">(</span>get tab2 <span style="color: #7388d6;">(</span>+ 1 2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 'three</span>
<span style="color: #707183;">(</span>get <span style="color: #7388d6;">{</span><span style="color: #2aa198; font-weight: bold;">'k</span> <span style="color: #2aa198; font-weight: bold;">'v</span><span style="color: #7388d6;">}</span> <span style="color: #2aa198; font-weight: bold;">'k</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 'v</span>

<span style="color: #586e75; font-style: italic;">;; dot makes it convenient to descend on tables with symbolic key names</span>
tab1.child.name <span style="color: #586e75; font-style: italic;">;=&gt; "Table Jr."</span>
<span style="color: #586e75; font-style: italic;">;; equivalent expression:</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">dot</span> tab1 child name<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Since tables are mutable, the main way to populate them is to use the <code>set!</code>
operator (the same one as for local variables). In this case, the first argument
may be any legal <code>get</code> or <code>dot</code> expression on a table.
</p>

<div class="org-src-container">
<pre class="src src-fn">
</pre>
</div>

<p>
Lastly, tables size can be checked with <code>length</code>, a list of keys can be retrieved
with <code>table-keys</code>, and two or more tables can be combined with <code>concat</code> (if any of
the tables have keys in common, the last table in the argument list takes
priority).
</p>
</div>
</div>


<div id="outline-container-orgf7b37f7" class="outline-4">
<h4 id="orgf7b37f7"><span class="section-number-4">2.2.4</span> Quoting</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
"Quoting" refers to the process of converting Fn source code into native Fn
data. This allows us to easily process and manipulate Fn source code using the
same facilities as for normal data.
</p>

<p>
Quoting is the secret sauce that makes Fn's macro system work. It's the main
reason why Fn has the syntax it has.
</p>

<p>
The <code>quote</code> special operator has syntax:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">quote</span> &lt;expr&gt;<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; or, equivalently</span>
<span style="color: #2aa198; font-weight: bold;">'&lt;expr&gt;</span>
</pre>
</div>
<p>
where <code>&lt;expr&gt;</code> can be any expression (in fact, it need not be a legal expression
by itself). These two notations are exactly the same. The interpreter expands
the second into the first before evaluation.
</p>

<p>
The value returned by quote is guaranteed to only consist of lists, symbols,
numbers, and strings. We refer to the latter three as <b>atoms</b>. Here are some
examples:
</p>
<div class="org-src-container">
<pre class="src src-fn">'<span style="color: #707183;">(</span>a b c<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; returns ['a 'b 'c]</span>
'<span style="color: #8b7355;">"string"</span> <span style="color: #586e75; font-style: italic;">;; returns "string"</span>
'<span style="color: #707183;">(</span>+ a <span style="color: #7388d6;">(</span>/ x 2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; returns ['+ 'a ['/ 'x 2]]</span>

'<span style="color: #2aa198; font-weight: bold;">'quot</span> <span style="color: #586e75; font-style: italic;">;; is equivalent to</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">quote</span> <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">quote</span> quot<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; which returns ['quote 'quot]</span>
</pre>
</div>

<p>
Note that <code>&lt;expr&gt;</code> only needs to be syntactically valid (i.e. not freak out the
parser). Illegal expressions can be quoted just fine:
</p>
<div class="org-src-container">
<pre class="src src-fn">'<span style="color: #707183;">()</span> <span style="color: #586e75; font-style: italic;">;; returns [] (the empty list)</span>
'<span style="color: #707183;">(</span>2 <span style="color: #7388d6;">(</span>3 4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; returns [2 [3 4]]</span>
'<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">quote</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; returns ['quote]</span>
</pre>
</div>

<p>
This makes <code>quote</code> very handy for creating nested lists of atoms. (<code>quote</code> also has
a big sister named <code>quasiquote</code>, which is covered in the section on macros, and
allows for much more flexibility).
</p>

<p>
<code>quote</code> is also the primary way to create symbols. As noted in subsection <a href="#org943233a">2.2.1</a>, this can lead to problems when we want a symbol whose name is a
syntactically valid number. Adding an escape character to the symbol name
designates to the parser that the token should be read as a symbol rather than a
number. In fact, we can even use this trick to give variables numbers for names:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; probably don't do this</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> \2 3<span style="color: #707183;">)</span>
2  <span style="color: #586e75; font-style: italic;">;; returns 2</span>
\2 <span style="color: #586e75; font-style: italic;">;; returns 3</span>
</pre>
</div>

<p>
My recommendation: just don't use symbol names that are syntactically legal
numbers.
</p>
</div>
</div>
</div>


<div id="outline-container-orgf0f7143" class="outline-3">
<h3 id="orgf0f7143"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Control Flow and Functions</h3>
<div class="outline-text-3" id="text-2-3">
</div>
