fn-manual.html
<div id="outline-container-org0ed65bc" class="outline-4">
<h4 id="org0ed65bc"><span class="section-number-4">2.3.1</span> <span class="todo TODO">TODO</span> Conditional Execution</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
The conditional control flow primitives are <code>if</code> and <code>cond</code>.
</p>

<p>
<code>if</code> takes exactly three arguments: a test expression, an expression to evaluate
if the test is true, and an expression to evaluate if the test is false. In Fn,
<code>nil</code> and <code>false</code> are considered to be false values, while all others are treated as
<code>true</code>.
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; if and cond syntax</span>

<span style="color: #586e75; font-style: italic;">;; cond takes pairs of expressions and consequences</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
  <span style="color: #2aa198; font-weight: bold;">false</span> 1
  <span style="color: #2aa198; font-weight: bold;">nil</span>   2
  <span style="color: #2aa198; font-weight: bold;">'foo</span>  3
  <span style="color: #2aa198; font-weight: bold;">true</span>  4<span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">; =&gt; returns 3, because 'foo is the first true value</span>

<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #cd9b1d;">fizzbuzz</span> <span style="color: #7388d6;">(</span>x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
    <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>mod x 15<span style="color: #709870;">)</span> 0<span style="color: #909183;">)</span> <span style="color: #2aa198; font-weight: bold;">'FizzBuzz</span>
    <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>mod x 5<span style="color: #709870;">)</span> 0<span style="color: #909183;">)</span>  <span style="color: #2aa198; font-weight: bold;">'Buzz</span>
    <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>mod x 3<span style="color: #709870;">)</span> 0<span style="color: #909183;">)</span>  <span style="color: #2aa198; font-weight: bold;">'Fizz</span>
    <span style="color: #2aa198; font-weight: bold;">true</span>             x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>fizzbuzz 6<span style="color: #707183;">)</span>  <span style="color: #586e75; font-style: italic;">; = Fizz</span>
<span style="color: #707183;">(</span>fizzbuzz 7<span style="color: #707183;">)</span>  <span style="color: #586e75; font-style: italic;">; = 7</span>
<span style="color: #707183;">(</span>fizzbuzz 45<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; = FizzBuzz</span>
<span style="color: #707183;">(</span>fizzbuzz 65<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; = Buzz</span>
</pre>
</div>

<p>
<code>cond</code> is an alternative conditional syntax which is analogous to "if/else if"
blocks in other programming languages. <code>cond</code> takes pairs of arguments and treats
the first one as a test. If the test is true, it returns the result of the
second argument in the pair. Otherwise it proceeds to the next pair, returning
<code>nil</code> if the end is reached.
</p>
</div>
</div>
