fn-manual.org
*** TODO Functions and Calls

Function calls have already been shown frequently in the manual prior to this
point. For example, we've seen arithmetic with the functions ~+~, ~-~, ~*~, and ~/~:
#+BEGIN_SRC fn
(+ 1 2 3)      ; => 6
(- (/ 6 2) 3)  ; => 0
(* 17 (- 2 7)) ; => -85
#+END_SRC

As you may have already surmised, in each parenthesized list above, the first
element is the function and the remaining ones are its arguments. All
parenthesized forms in Fn are either special forms, macros, or function calls,
with function calls being the "default" and by far the most common.

Functions are created with the ~fn~ special form, which requires a parameter list
followed by a series of expressions that make up the function's body.

#+BEGIN_SRC fn
; square a number
(def square
  (fn (x)
    (* x x))

(square 2) ; => 4

; compute sqrt(x^2 + y^2)
(def 2-norm 
  (fn (x y)
    (sqrt (+ (square x) (square y)))))

(2-norm 3 4)  ; => 5
(2-norm 5 12) ; => 13
#+END_SRC

The syntax ~(defn ...)~ is nothing more than a shorten way to say ~(def .. (fn
...))~.

Functions can accept varying numbers of arguments. For this Fn offers *optional
parameters* and *variadic parameters*. Optional parameters have default values that
they assume when not passed explicitly. Variadic parameters, on the other hand,
allow a function to be called with more arguments than it has parameters. The
trailing arguments are passed to the function as a list. These are illustrated
below:

#+BEGIN_SRC fn
; compute the p-norm of (x,y), which is |x^p + y^p|^(1/p). 
; default is p = 2
(defn p-norm (x y (p 2))
  (let xp (** x p)
       yp (** y p))
  (** (abs (+ xp yp)) (/ 1 p)))

; p-norm accepts either 2 or 3 arguments
(p-norm 3 4)    ; => 5
(p-norm 3 4 2)  ; => 5 (same as default)
(p-norm 3 4 1)  ; => 7 (now p = 1)

; compute x1^2 + x2^2 + ...
(defn sum-squared (& args)
  ; see below for explanation of this line
  (apply + (map square args)))

; accepts any number of arguments
(sum-squared)       ; => 0
(sum-squared 1)     ; => 1
(sum-squared 1 2)   ; => 5
(sum-squared 1 2 4) ; => 21
#+END_SRC

Explanation of the function ~sum-squared~ above: ~map~ applies a function to every
element of the list, in this case squaring each of the arguments. ~apply~,
explained in [[~apply~]], passes the elements of a list to a function as positional
arguments, in this case summing all the elements of the list.

As you can see, optional parameters, (of which there may be zero or more), are
designated by putting them in parenthesized lists with a default value. Variadic
parameters, (of which their may be zero or one), are designated by the special
symbol ~&~. No additional parameters can follow variadic parameters.

Variadic and optional parameters can be mixed, in which case the variadic
parameter picks up where the optional parameters leave off.


*** TODO ~apply~

