fn-manual.html


<div id="outline-container-org86219ad" class="outline-4">
<h4 id="org86219ad"><span class="section-number-4">2.3.2</span> Functions and Calls</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Function calls have already been shown frequently in the manual prior to this
point. For example, we've seen arithmetic with the functions <code>+</code>, <code>-</code>, <code>*</code>, and <code>/</code>:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span>+ 1 2 3<span style="color: #707183;">)</span>      <span style="color: #586e75; font-style: italic;">; =&gt; 6</span>
<span style="color: #707183;">(</span>- <span style="color: #7388d6;">(</span>/ 6 2<span style="color: #7388d6;">)</span> 3<span style="color: #707183;">)</span>  <span style="color: #586e75; font-style: italic;">; =&gt; 0</span>
<span style="color: #707183;">(</span>* 17 <span style="color: #7388d6;">(</span>- 2 7<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; =&gt; -85</span>
</pre>
</div>

<p>
As you may have already surmised, in each parenthesized list above, the first
element is the function and the remaining ones are its arguments. All
parenthesized forms in Fn are either special forms, macros, or function calls,
with function calls being the "default" and by far the most common.
</p>

<p>
Functions are created with the <code>fn</code> special form, which requires a parameter list
followed by a series of expressions that make up the function's body.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">; square a number</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> square
  <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">fn</span> <span style="color: #909183;">(</span>x<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>* x x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

<span style="color: #7388d6;">(</span>square 2<span style="color: #7388d6;">)</span> <span style="color: #586e75; font-style: italic;">; =&gt; 4</span>

<span style="color: #586e75; font-style: italic;">; compute sqrt(x^2 + y^2)</span>
<span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">def</span> 2-norm 
  <span style="color: #909183;">(</span><span style="color: #859900; font-weight: bold;">fn</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span>sqrt <span style="color: #907373;">(</span>+ <span style="color: #6276ba;">(</span>square x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>square y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

<span style="color: #7388d6;">(</span>2-norm 3 4<span style="color: #7388d6;">)</span>  <span style="color: #586e75; font-style: italic;">; =&gt; 5</span>
<span style="color: #7388d6;">(</span>2-norm 5 12<span style="color: #7388d6;">)</span> <span style="color: #586e75; font-style: italic;">; =&gt; 13</span>
</pre>
</div>

<p>
The syntax <code>(defn ...)</code> is nothing more than a shorten way to say <code>(def .. (fn
...))</code>.
</p>

<p>
Functions can accept varying numbers of arguments. For this Fn offers <b>optional
parameters</b> and <b>variadic parameters</b>. Optional parameters have default values that
they assume when not passed explicitly. Variadic parameters, on the other hand,
allow a function to be called with more arguments than it has parameters. The
trailing arguments are passed to the function as a list. These are illustrated
below:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">; compute the p-norm of (x,y), which is |x^p + y^p|^(1/p). </span>
<span style="color: #586e75; font-style: italic;">; default is p = 2</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #cd9b1d;">p-norm</span> <span style="color: #7388d6;">(</span>x y <span style="color: #909183;">(</span>p 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">let</span> xp <span style="color: #909183;">(</span>** x p<span style="color: #909183;">)</span>
       yp <span style="color: #909183;">(</span>** y p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>** <span style="color: #909183;">(</span>abs <span style="color: #709870;">(</span>+ xp yp<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>/ 1 p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #586e75; font-style: italic;">; p-norm accepts either 2 or 3 arguments</span>
<span style="color: #707183;">(</span>p-norm 3 4<span style="color: #707183;">)</span>    <span style="color: #586e75; font-style: italic;">; =&gt; 5</span>
<span style="color: #707183;">(</span>p-norm 3 4 2<span style="color: #707183;">)</span>  <span style="color: #586e75; font-style: italic;">; =&gt; 5 (same as default)</span>
<span style="color: #707183;">(</span>p-norm 3 4 1<span style="color: #707183;">)</span>  <span style="color: #586e75; font-style: italic;">; =&gt; 7 (now p = 1)</span>

<span style="color: #586e75; font-style: italic;">; compute x1^2 + x2^2 + ...</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #cd9b1d;">sum-squared</span> <span style="color: #7388d6;">(</span><span style="color: #859900;">&amp;</span> args<span style="color: #7388d6;">)</span>
  <span style="color: #586e75; font-style: italic;">; see below for explanation of this line</span>
  <span style="color: #7388d6;">(</span>apply + <span style="color: #909183;">(</span>map square args<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #586e75; font-style: italic;">; accepts any number of arguments</span>
<span style="color: #707183;">(</span>sum-squared<span style="color: #707183;">)</span>       <span style="color: #586e75; font-style: italic;">; =&gt; 0</span>
<span style="color: #707183;">(</span>sum-squared 1<span style="color: #707183;">)</span>     <span style="color: #586e75; font-style: italic;">; =&gt; 1</span>
<span style="color: #707183;">(</span>sum-squared 1 2<span style="color: #707183;">)</span>   <span style="color: #586e75; font-style: italic;">; =&gt; 5</span>
<span style="color: #707183;">(</span>sum-squared 1 2 4<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; =&gt; 21</span>
</pre>
</div>

<p>
Explanation of the function <code>sum-squared</code> above: <code>map</code> applies a function to every
element of the list, in this case squaring each of the arguments. <code>apply</code>,
explained in <a href="#orgabb132d">2.3.4</a>, passes the elements of a list to a function as positional
arguments, in this case summing all the elements of the list.
</p>

<p>
As you can see, optional parameters, (of which there may be zero or more), are
designated by putting them in parenthesized lists with a default value. Variadic
parameters, (of which their may be zero or one), are designated by the special
symbol <code>&amp;</code>. No additional parameters can follow variadic parameters.
</p>

<p>
Variadic and optional parameters can be mixed, in which case the variadic
parameter picks up where the optional parameters leave off.
</p>
</div>

<ol class="org-ol">
