fn-manual.org
*** Import

The ~import~ special form allows definitions from an external namespace to be
copied into the current one. The syntax for import looks like this:

#+BEGIN_SRC fn
(import <namespace-id>)                  ; invocation 1
(import <namespace-id> :as <alias>)      ; invocation 2
(import <namespace-id> :no-prefix true)  ; invocation 3
#+END_SRC

Say we have a namespace ~foo/bar/baz~ containing variables named ~bob~ and
~alice~:
#+BEGIN_SRC fn
;;; baz.fn
(package foo/bar)
(def alice "Alice")
(def bob "Bob")
#+END_SRC

We have three ways to import this namespace, shown above. All three cause the
definitions from ~foo/bar/baz~ to be copied into the current namespace. However,
in each case the created bindings will have different names. The three cases are
illustrated below:

#+BEGIN_SRC fn
;;; main.fn

;; invocation 1
(import foo/bar/baz)
; variables look like this:
baz:alice
baz:bob

;; invocation 2
(import foo/bar/baz :as b)
; variables look like this:
b:alice
b:bob

;; invocation 3
(import foo/bar/baz :no-prefix true)
; variables are imported directly (no colons)
alice
bob
#+END_SRC


*** Package Declarations

The first expression of a file (not counting comments) may be a *package
declaration*. These have the form ~(package <package-name>)~, where <package-name>
is a symbol. This simply sets the package name for the file when it is
interpreted. If no package declaration is present, the package ~fn/user~ is used.

When a file is imported, a warning is generated if its package declaration
disagrees with the package of the import. The import will still work, but some
code may break.


*** Global Identifiers for Definitions

When a new definition is made in any namespace, it is given a global identifier
of the form ~#/<namespace-id>:<symbol>~ (since namespace IDs are unique, this is
unique among all global definitions). Global IDs may be used as variable names
to reference the definition without explicitly importing it. For example,
~#/fn/builtin:map~ refers to the function ~map~ in the ~fn/builtin~ namespace.


*** Locating Namespace Sources

*Note:* This section is a precise, technical description of how namespace search
works. In reality, you don't have to think so hard about namespace import. It
works the way you'd want it to. For instance, I do ~(import pkg/bar/baz)~ from ~pkg/foo~, it
searches for a file ~bar/baz.fn~ in the directory of ~foo.fn~.

The first time a namespace is imported, we must find and load its source file.
Subsequent imports will reuse the created namespace.

When a file is run, its package is set as the *root package* and the file's
directory is set as the *working directory*. When a new import is encountered, the
following locations are searched:
- If the imported namespace is in the root package, then we search for the file
  ~name.fn~ in the working directory.
- If the imported package is in a subspace of the root package, say
  ~root/subpackage/name~, then we look for the file ~subpackage/name.fn~ in the
  working directory.
- If the environment variable FN_SEARCH_PATH is set to a colon-delimited
  sequence of directories, then we search each directory in the order provided.
  The file we look for is ~package/fn~, where slashes in the package are converted
  into subdirectories in the search.
- Finally, the system namespace directory ~${PREFIX}/ns~ is searched. ~${PREFIX}~ is
  usually ~/usr/local/lib/fn/~.

Example: We have the following files:
- project/main.fn
- project/engine.fn
- project/util/http.fn
- project/util/math.fn

Suppose main.fn has the following package declaration:
#+BEGIN_SRC fn
(package devco/product)
#+END_SRC

If we run the file main.fn, we can import all the other files like this:
#+BEGIN_SRC fn
(import devco/product/engine)
(import devco/product/util/http)
(import devco/product/util/math)
#+END_SRC

Furthermore, these names are preserved in nested imports. For instance, in
http.fn we can import engine.fn and math.fn like this:
#+BEGIN_SRC fn
(import devco/product/engine)
(import devco/product/util/math)
#+END_SRC


** TODO Macros


*** Macro Basics


*** Quasiquotation


*** Variable Capture and ~gensym~


* Command Line Interface

All functionality is accessed via the ~fn~ command line program.

