fn-manual.html


<div id="outline-container-org9236925" class="outline-4">
<h4 id="org9236925"><span class="section-number-4">2.4.1</span> Import</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
The <code>import</code> special form allows definitions from an external namespace to be
copied into the current one. The syntax for import looks like this:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> &lt;namespace-id&gt;<span style="color: #707183;">)</span>                  <span style="color: #586e75; font-style: italic;">; invocation 1</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> &lt;namespace-id&gt; <span style="color: #859900;">:as</span> &lt;alias&gt;<span style="color: #707183;">)</span>      <span style="color: #586e75; font-style: italic;">; invocation 2</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> &lt;namespace-id&gt; <span style="color: #859900;">:no-prefix</span> <span style="color: #2aa198; font-weight: bold;">true</span><span style="color: #707183;">)</span>  <span style="color: #586e75; font-style: italic;">; invocation 3</span>
</pre>
</div>

<p>
Say we have a namespace <code>foo/bar/baz</code> containing variables named <code>bob</code> and
<code>alice</code>:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;;; baz.fn</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">package</span> foo/bar<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> alice <span style="color: #8b7355;">"Alice"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> bob <span style="color: #8b7355;">"Bob"</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
We have three ways to import this namespace, shown above. All three cause the
definitions from <code>foo/bar/baz</code> to be copied into the current namespace. However,
in each case the created bindings will have different names. The three cases are
illustrated below:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;;; main.fn</span>

<span style="color: #586e75; font-style: italic;">;; invocation 1</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> foo/bar/baz<span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">; variables look like this:</span>
baz:alice
baz:bob

<span style="color: #586e75; font-style: italic;">;; invocation 2</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> foo/bar/baz <span style="color: #859900;">:as</span> b<span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">; variables look like this:</span>
b:alice
b:bob

<span style="color: #586e75; font-style: italic;">;; invocation 3</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> foo/bar/baz <span style="color: #859900;">:no-prefix</span> <span style="color: #2aa198; font-weight: bold;">true</span><span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">; variables are imported directly (no colons)</span>
alice
bob
</pre>
</div>
</div>
</div>


<div id="outline-container-org0dda6be" class="outline-4">
<h4 id="org0dda6be"><span class="section-number-4">2.4.2</span> Package Declarations</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
The first expression of a file (not counting comments) may be a <b>package
declaration</b>. These have the form <code>(package &lt;package-name&gt;)</code>, where &lt;package-name&gt;
is a symbol. This simply sets the package name for the file when it is
interpreted. If no package declaration is present, the package <code>fn/user</code> is used.
</p>

<p>
When a file is imported, a warning is generated if its package declaration
disagrees with the package of the import. The import will still work, but some
code may break.
</p>
</div>
</div>


<div id="outline-container-org3775542" class="outline-4">
<h4 id="org3775542"><span class="section-number-4">2.4.3</span> Global Identifiers for Definitions</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
When a new definition is made in any namespace, it is given a global identifier
of the form <code>#/&lt;namespace-id&gt;:&lt;symbol&gt;</code> (since namespace IDs are unique, this is
unique among all global definitions). Global IDs may be used as variable names
to reference the definition without explicitly importing it. For example,
<code>#/fn/builtin:map</code> refers to the function <code>map</code> in the <code>fn/builtin</code> namespace.
</p>
</div>
</div>


<div id="outline-container-org916f1a3" class="outline-4">
<h4 id="org916f1a3"><span class="section-number-4">2.4.4</span> Locating Namespace Sources</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
<b>Note:</b> This section is a precise, technical description of how namespace search
works. In reality, you don't have to think so hard about namespace import. It
works the way you'd want it to. For instance, I do <code>(import pkg/bar/baz)</code> from <code>pkg/foo</code>, it
searches for a file <code>bar/baz.fn</code> in the directory of <code>foo.fn</code>.
</p>

<p>
The first time a namespace is imported, we must find and load its source file.
Subsequent imports will reuse the created namespace.
</p>

<p>
When a file is run, its package is set as the <b>root package</b> and the file's
directory is set as the <b>working directory</b>. When a new import is encountered, the
following locations are searched:
</p>
<ul class="org-ul">
<li>If the imported namespace is in the root package, then we search for the file
<code>name.fn</code> in the working directory.</li>
<li>If the imported package is in a subspace of the root package, say
<code>root/subpackage/name</code>, then we look for the file <code>subpackage/name.fn</code> in the
working directory.</li>
<li>If the environment variable FN<sub>SEARCH</sub><sub>PATH</sub> is set to a colon-delimited
sequence of directories, then we search each directory in the order provided.
The file we look for is <code>package/fn</code>, where slashes in the package are converted
into subdirectories in the search.</li>
<li>Finally, the system namespace directory <code>${PREFIX}/ns</code> is searched. <code>${PREFIX}</code> is
usually <code>/usr/local/lib/fn/</code>.</li>
</ul>

<p>
Example: We have the following files:
</p>
<ul class="org-ul">
<li>project/main.fn</li>
<li>project/engine.fn</li>
<li>project/util/http.fn</li>
<li>project/util/math.fn</li>
</ul>

<p>
Suppose main.fn has the following package declaration:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">package</span> devco/product<span style="color: #707183;">)</span>
</pre>
</div>

<p>
If we run the file main.fn, we can import all the other files like this:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> devco/product/engine<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> devco/product/util/http<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> devco/product/util/math<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Furthermore, these names are preserved in nested imports. For instance, in
http.fn we can import engine.fn and math.fn like this:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> devco/product/engine<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> devco/product/util/math<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org2f80de1" class="outline-3">
<h3 id="org2f80de1"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> Macros</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org90c1ccb" class="outline-4">
<h4 id="org90c1ccb"><span class="section-number-4">2.5.1</span> Macro Basics</h4>
</div>


<div id="outline-container-org761cf21" class="outline-4">
<h4 id="org761cf21"><span class="section-number-4">2.5.2</span> Quasiquotation</h4>
</div>


<div id="outline-container-org9b6b88c" class="outline-4">
<h4 id="org9b6b88c"><span class="section-number-4">2.5.3</span> Variable Capture and <code>gensym</code></h4>
</div>
</div>
</div>


<div id="outline-container-org344888c" class="outline-2">
<h2 id="org344888c"><span class="section-number-2">3</span> Command Line Interface</h2>
<div class="outline-text-2" id="text-3">
<p>
All functionality is accessed via the <code>fn</code> command line program.
</p>
</div>
