fn-manual.org
** Invocation and Namespace Determination

The fn command line tool has the following interface:
#+begin_src
fn [options] [file | --eval string | - ] ARGS
#+end_src

When invoked without any arguments, a repl is started in namespace ~fn/user~.

The main options are:
- ~-r~ :: Start a REPL after evaluating all sources.
- ~--ns <namespace>~ :: Use the specified namespace for evaluation. This also sets
  the namespace for the REPL (which otherwise defaults to ~fn/user~).
- ~--no-rel-imports~ :: Prevents ~import~ from searching for paths relative to the
  filename. See subsection [[Import Search]] for details.
- ~-h~ :: Show help and exit.
There are also two more options that are unlikely to be useful for a typical
user:
- ~-d~ :: Print disassembled bytecode after compiling each expression.
- ~-l~ :: Print LLIR (low-level intermediate representation) before compiling each
  expression.

When an ~--ns~ option is used with a file, that file's namespace name is
overridden by the specified namespace. The file then just acts as a series of
expressions to evaluate. This also prevents import from searching relative to
the file path.

In the absence of an ~--ns~ option, the namespace of a file is determined by the
filename and contents. In particular, the filename stem is used as the short
name. If the file specifies a package, then that package is used, otherwise the
default package ~fn/user~ is used, e.g. a file ~foo.fn~ with no package declaration
would be evaluated in the namespace ~fn/user/foo~.


** Import Search

When the interpreter encounters an import form, it must locate and load the
relevant source file (unless the namespace has already been created, as is the
case for the builtin namespace, or for those namespaces already imported by
another component).

The interpreter has two ways to search for imports. The first way is to use the
package and directory of a file to locate other components, while the second is
to simply use a search path. The search path approach is pretty straightforward;
it can be set using the ~FN_SEARCH_PATH~ environment variable, but by default it
will simply check the Fn library directory on the system (something like
~/usr/lib/Fn/ns~) before giving up.

The first search method mentioned is called relative import search. This is how
it works:
- The interpreter has a notion of a /working directory/. When evaluating a file,
  this is set to the directory containing the file. Otherwise it is the
  directory from which the interpreter was launched.
- The interpreter associates the package of the code being evaluated to the
  working directory. This package is saved by the interpreter as the /root
  package/.
- When an import is performed on any subpackage of the root package (including
  the root package itself), the interpreter will search for import files
  relative to the working directory based on the import name. (It will fall
  back to the search path if this fails).

The specifics of the search algorithm are best explained by example. Suppose I
evaluate a file ~bar.fn~ with package ~baz/foo~. The namespace for the file is
~baz/foo/bar~ and the working directory is the directory of ~bar.fn~, which we'll
write as ~${BAR_DIR}~.

Let's see how imports work in this scenario:
- ~(import baz/foo/oof)~ will cause the interpreter to look for a file
  ~${BAR_DIR}/oof.fn~. This is because the directory ~${BAR_DIR}~ is associated to
  the package ~baz/foo~.
- Similarly, ~(import baz/foo/boom/grop)~ looks for the file
  ~${BAR_DIR}/boom/grop.fn~.
- However, ~(import baz/dop)~ will *not* look for a file named ~${BAR_DIR}/../dop.fn~,
  because ~baz~ is not a subpackage of ~baz/foo~.

Lastly, we make one important notes about imports. Even if a file is located, it
will not be used if it has a package declaration which doesn't match up with the
requested one. In the above example, if we find ~${BAR_DIR}/oof.fn~, but it has a
package declaration placing it somewhere other than ~baz/foo~, then the import
will fail (and we'll end up using the search path).


** REPL

Fn's REPL allows interactive evaluation of code. It supports multi-line
expressions. Optional GNU readline support is planned, but for now, it is highly
recommended that you run the REPL in a wrapper that has command history, such as
rlwrap or Emacs shell-mode.

Additional functionality can be accessed by typing keywords (i.e. symbols whose
names begin with ":"). The available REPL keywords are:

- ~:help~ :: List these options.
- ~:quit~ :: Quit the interpreter. Can also be done by sending EOF with ctrl-d.
- ~:load <filename>~ :: Evaluate a file in the current namespace.
- ~:reimport <namespace>~ :: Redo a namespace import as if it was for the first
  time. Be warned that this will not overwrite the old functions if they've
  already been compiled into a new one.
- ~:ns <namespace>~ :: Switch to the given namespace.

To be interpreted as REPL commands, these cannot be preceded by any whitespace.

At the time of writing, these are not actually implemented in the codebase, but
you can try your luck because there's a chance that this document is out of sync
with my progress.


* Builtin Functions

