fn-manual.html

<div id="outline-container-org886d80d" class="outline-3">
<h3 id="org886d80d"><span class="section-number-3">3.1</span> Invocation and Namespace Determination</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The fn command line tool has the following interface:
</p>
<pre class="example">
fn [options] [file | --eval string | - ] ARGS
</pre>

<p>
When invoked without any arguments, a repl is started in namespace <code>fn/user</code>.
</p>

<p>
The main options are:
</p>
<dl class="org-dl">
<dt><code>-r</code></dt><dd>Start a REPL after evaluating all sources.</dd>
<dt><code>--ns &lt;namespace&gt;</code></dt><dd>Use the specified namespace for evaluation. This also sets
the namespace for the REPL (which otherwise defaults to <code>fn/user</code>).</dd>
<dt><code>--no-rel-imports</code></dt><dd>Prevents <code>import</code> from searching for paths relative to the
filename. See subsection <a href="#org6af3803">3.2</a> for details.</dd>
<dt><code>-h</code></dt><dd>Show help and exit.</dd>
</dl>
<p>
There are also two more options that are unlikely to be useful for a typical
user:
</p>
<dl class="org-dl">
<dt><code>-d</code></dt><dd>Print disassembled bytecode after compiling each expression.</dd>
<dt><code>-l</code></dt><dd>Print LLIR (low-level intermediate representation) before compiling each
expression.</dd>
</dl>

<p>
When an <code>--ns</code> option is used with a file, that file's namespace name is
overridden by the specified namespace. The file then just acts as a series of
expressions to evaluate. This also prevents import from searching relative to
the file path.
</p>

<p>
In the absence of an <code>--ns</code> option, the namespace of a file is determined by the
filename and contents. In particular, the filename stem is used as the short
name. If the file specifies a package, then that package is used, otherwise the
default package <code>fn/user</code> is used, e.g. a file <code>foo.fn</code> with no package declaration
would be evaluated in the namespace <code>fn/user/foo</code>.
</p>
</div>
</div>


<div id="outline-container-org6af3803" class="outline-3">
<h3 id="org6af3803"><span class="section-number-3">3.2</span> Import Search</h3>
<div class="outline-text-3" id="text-3-2">
<p>
When the interpreter encounters an import form, it must locate and load the
relevant source file (unless the namespace has already been created, as is the
case for the builtin namespace, or for those namespaces already imported by
another component).
</p>

<p>
The interpreter has two ways to search for imports. The first way is to use the
package and directory of a file to locate other components, while the second is
to simply use a search path. The search path approach is pretty straightforward;
it can be set using the <code>FN_SEARCH_PATH</code> environment variable, but by default it
will simply check the Fn library directory on the system (something like
<code>/usr/lib/Fn/ns</code>) before giving up.
</p>

<p>
The first search method mentioned is called relative import search. This is how
it works:
</p>
<ul class="org-ul">
<li>The interpreter has a notion of a <i>working directory</i>. When evaluating a file,
this is set to the directory containing the file. Otherwise it is the
directory from which the interpreter was launched.</li>
<li>The interpreter associates the package of the code being evaluated to the
working directory. This package is saved by the interpreter as the <i>root
package</i>.</li>
<li>When an import is performed on any subpackage of the root package (including
the root package itself), the interpreter will search for import files
relative to the working directory based on the import name. (It will fall
back to the search path if this fails).</li>
</ul>

<p>
The specifics of the search algorithm are best explained by example. Suppose I
evaluate a file <code>bar.fn</code> with package <code>baz/foo</code>. The namespace for the file is
<code>baz/foo/bar</code> and the working directory is the directory of <code>bar.fn</code>, which we'll
write as <code>${BAR_DIR}</code>.
</p>

<p>
Let's see how imports work in this scenario:
</p>
<ul class="org-ul">
<li><code>(import baz/foo/oof)</code> will cause the interpreter to look for a file
<code>${BAR_DIR}/oof.fn</code>. This is because the directory <code>${BAR_DIR}</code> is associated to
the package <code>baz/foo</code>.</li>
<li>Similarly, <code>(import baz/foo/boom/grop)</code> looks for the file
<code>${BAR_DIR}/boom/grop.fn</code>.</li>
<li>However, <code>(import baz/dop)</code> will <b>not</b> look for a file named <code>${BAR_DIR}/../dop.fn</code>,
because <code>baz</code> is not a subpackage of <code>baz/foo</code>.</li>
</ul>

<p>
Lastly, we make one important notes about imports. Even if a file is located, it
will not be used if it has a package declaration which doesn't match up with the
requested one. In the above example, if we find <code>${BAR_DIR}/oof.fn</code>, but it has a
package declaration placing it somewhere other than <code>baz/foo</code>, then the import
will fail (and we'll end up using the search path).
</p>
</div>
</div>


<div id="outline-container-orgafae78b" class="outline-3">
<h3 id="orgafae78b"><span class="section-number-3">3.3</span> REPL</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Fn's REPL allows interactive evaluation of code. It supports multi-line
expressions. Optional GNU readline support is planned, but for now, it is highly
recommended that you run the REPL in a wrapper that has command history, such as
rlwrap or Emacs shell-mode.
</p>

<p>
Additional functionality can be accessed by typing keywords (i.e. symbols whose
names begin with ":"). The available REPL keywords are:
</p>

<dl class="org-dl">
<dt><code>:help</code></dt><dd>List these options.</dd>
<dt><code>:quit</code></dt><dd>Quit the interpreter. Can also be done by sending EOF with ctrl-d.</dd>
<dt><code>:load &lt;filename&gt;</code></dt><dd>Evaluate a file in the current namespace.</dd>
<dt><code>:reimport &lt;namespace&gt;</code></dt><dd>Redo a namespace import as if it was for the first
time. Be warned that this will not overwrite the old functions if they've
already been compiled into a new one.</dd>
<dt><code>:ns &lt;namespace&gt;</code></dt><dd>Switch to the given namespace.</dd>
</dl>

<p>
To be interpreted as REPL commands, these cannot be preceded by any whitespace.
</p>

<p>
At the time of writing, these are not actually implemented in the codebase, but
you can try your luck because there's a chance that this document is out of sync
with my progress.
</p>
</div>
</div>
</div>
