fn-manual.html


<div id="outline-container-org990e8be" class="outline-2">
<h2 id="org990e8be"><span class="section-number-2">4</span> Builtin Functions</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org6e9445e" class="outline-3">
<h3 id="org6e9445e"><span class="section-number-3">4.1</span> <code>fn/builtin</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
These functions are automatically imported into every namespace upon creation.
They are not all implemented at the time of writing, but a surprising number
are.
</p>

<p>
<b>Equality Comparisons</b>
</p>
<ul class="org-ul">
<li><code>= (&amp; args)</code>
<ul class="org-ul">
<li>Returns true if all args are semantically equal</li>
</ul></li>
<li><code>same? (&amp; args)</code>
<ul class="org-ul">
<li>Behaves the same as <code>=</code> for numbers, symbols, bools, and the empty
list. For other types, only returns true if all the arguments correspond to
the same garbage collector object.</li>
</ul></li>
</ul>


<p>
<b>Type queries:</b>
</p>
<ul class="org-ul">
<li><code>number?</code>, <code>string?</code>, <code>list?</code>, <code>table?</code>, <code>function?</code>, <code>symbol?</code>, <code>bool?</code>
<ul class="org-ul">
<li>These accept a single argument and return true if it has the corresponding
type, false otherwise.</li>
</ul></li>
</ul>


<p>
<b>Functions on Symbols</b>
</p>
<ul class="org-ul">
<li><code>gensym ()</code>
<ul class="org-ul">
<li>create a nameless symbol which is guaranteed to be unique</li>
</ul></li>
<li><code>intern (string)</code>
<ul class="org-ul">
<li>create a symbol from a string</li>
</ul></li>
<li><code>symname (symbol)</code>
<ul class="org-ul">
<li>get a symbol's name as a string</li>
</ul></li>
</ul>

<p>
<b>Functions on Numbers</b>
</p>
<ul class="org-ul">
<li><code>+</code>, <code>-</code>, <code>*</code>, <code>/</code>, <code>**</code>
<ul class="org-ul">
<li>Arithmetic operators. These accept arbitrarily many arguments.</li>
<li><code>**</code> is exponentiation.</li>
<li>Calling with no arguments yields the identity element for the operation.</li>
<li>Calling with one argument yields the argument itself for <code>+</code>, <code>*</code>, and <code>**</code>, the
multiplicative inverse for <code>/</code>, and the additive inverse for <code>-</code>.</li>
<li>Underlying operations are performed on IEEE 64-bit floats (with truncated
significand).</li>
</ul></li>
<li><code>abs</code>, <code>exp</code>, <code>log</code>
<ul class="org-ul">
<li>Functions of exactly one argument that perform their respective mathematical
operations.</li>
<li><code>log</code> is natural log</li>
</ul></li>
<li><code>mod (quantity modulus)</code>
<ul class="org-ul">
<li>Computes <code>quantity</code> modulo <code>modulus</code>. The second argument must be an
integer.</li>
</ul></li>
<li><code>integer?</code>
<ul class="org-ul">
<li>One argument of any type. True if it's an integer, false otherwise.</li>
</ul></li>
<li><code>floor, ceil</code></li>
<li><code>frac-part</code></li>
<li><code>&lt;</code>, <code>&gt;</code>, <code>&lt;=</code>, <code>&gt;=</code>
<ul class="org-ul">
<li>The usual quantity comparisons. Accept arbitrarily many args. Always return
true if 1 or 0 args are passed.</li>
</ul></li>
</ul>

<p>
<b>Functions on Strings</b>
</p>
<ul class="org-ul">
<li><code>String (&amp; args)</code>
<ul class="org-ul">
<li>convert each argument to a string and concatenate them</li>
</ul></li>
<li><code>substring (str start (len -1))</code>
<ul class="org-ul">
<li>get a substring. Negative length values represent distances from the end of
the string, with -1 indicating that the substring should go to the end.</li>
</ul></li>
</ul>

<p>
<b>Functions on Lists</b>
</p>
<ul class="org-ul">
<li><code>List</code>
<ul class="org-ul">
<li>Creates a list from its arguments.</li>
</ul></li>
<li><code>cons (hd tl)</code>
<ul class="org-ul">
<li>prepend <code>hd</code> to a list <code>tl</code></li>
</ul></li>
<li><code>head, tail</code>
<ul class="org-ul">
<li>One argument. Get the head or tail of a list, respectively.</li>
</ul></li>
<li><code>nth (n list)</code>
<ul class="org-ul">
<li>Get the nth element of a list, indexed from 0.</li>
</ul></li>
<li><code>take,</code> <code>drop,</code> <code>split</code> <code>(n list)</code>
<ul class="org-ul">
<li><code>take</code> takes the first n elements of a list. <code>drop</code> drops the first n elements
of a list. <code>split</code> does both at once and returns a list <code>[front back]</code>, where
front and back are the two pieces of the list.</li>
</ul></li>
<li><code>take-while, drop-while, split-after (pred list)</code>
<ul class="org-ul">
<li><code>pred</code> is a function of one argument used as a predicate</li>
<li>Analogous to take, drop, and split, but instead of splitting after <code>n</code>
elements, they split on the first element for which <code>pred</code> fails.</li>
</ul></li>
</ul>

<p>
<b>Functions on Tables</b>
</p>
<ul class="org-ul">
<li><code>Table</code>
<ul class="org-ul">
<li>Accepts an even number of arguments. Treats them as alternating key/value
pairs and constructs a table.</li>
</ul></li>
<li><code>get (table key)</code>
<ul class="org-ul">
<li>Get a value from a table. A runtime exception is generated if the table has
no such key.</li>
</ul></li>
<li><code>get-default (table key (default nil))</code>
<ul class="org-ul">
<li>Get a value from a table, return default if it's not found.</li>
</ul></li>
<li><code>has-key? (table key)</code>
<ul class="org-ul">
<li>True or false depending on if key is a key for table.</li>
</ul></li>
<li><code>get-keys</code>
<ul class="org-ul">
<li>Returns a list of keys to a table. No promises about the order.</li>
</ul></li>
</ul>


<p>
<b>Functions on Collections</b> 
Strings aren't really collections, but some of these work on them too.
</p>
<ul class="org-ul">
<li><code>length</code>
<ul class="org-ul">
<li>Returns length for strings and lists, number of keys for tables.</li>
</ul></li>
<li><code>concat (&amp; args)</code>
<ul class="org-ul">
<li>Concatenate arguments in the order provided</li>
<li>All arguments must have the same type</li>
<li>When concatenating tables which have keys in common, the last table in the
argument list takes precedence.</li>
</ul></li>
<li><code>contains? (coll x)</code>
<ul class="org-ul">
<li>True if <code>(= x y)</code> for some <code>y</code> in the collection, false otherwise.</li>
<li>Doesn't work on strings</li>
</ul></li>
<li><code>reverse</code>
<ul class="org-ul">
<li>This one doesn't work on tables.</li>
</ul></li>
<li><code>empty?</code>
<ul class="org-ul">
<li>Works on strings, lists, and tables.</li>
</ul></li>
</ul>

<p>
<b>Functions on Bools</b>
</p>
<ul class="org-ul">
<li><code>or</code>, <code>and</code> (wrappers for the builtins)</li>
<li><code>not</code></li>
<li><code>nand</code></li>
<li><code>nor</code></li>
<li><code>xor</code></li>
<li><code>xnor</code></li>
</ul>

<p>
<b>Transformations</b>
</p>
<ul class="org-ul">
<li><code>apply (fun arg0 arg1 &amp; args)</code>
<ul class="org-ul">
<li>The last two arguments must be a list and a table, respectively. Calls the
provided function in the following way: all arguments before the last two
are passed as positional arguments. The list is expanded and its elements
are passed as positional arguments. The table is used for keyword arguments.
Its keys should be symbols (but not keywords).</li>
<li>This wraps a builtin operator</li>
</ul></li>
<li><code>partial (fun &amp; args)</code>
<ul class="org-ul">
<li>partially apply a function</li>
</ul></li>
<li><code>comp (fun &amp; funs)</code>
<ul class="org-ul">
<li>compose the provided functions</li>
</ul></li>
<li><code>map (fun &amp; colls)</code>
<ul class="org-ul">
<li>we all know <code>map</code></li>
<li>as a bonus, it also works on tables</li>
</ul></li>
<li><code>maprev (fun &amp; colls)</code>
<ul class="org-ul">
<li>like map, but only for lists and the resulting list is reversed</li>
<li>this is faster than map</li>
</ul></li>
<li><code>foldl (fun init coll)</code>
<ul class="org-ul">
<li>perform a left fold</li>
<li><code>fun</code> accepts arguments <code>(accumulator input)</code></li>
</ul></li>
<li><code>foldr (fun init coll)</code>
<ul class="org-ul">
<li>perform a right fold</li>
<li><code>fun</code> accepts arguments <code>(input accumulator)</code></li>
</ul></li>
<li><code>filter (fun coll)</code>
<ul class="org-ul">
<li>works on lists and tables</li>
</ul></li>
</ul>

<p>
<b>Macros</b>
</p>
<ul class="org-ul">
<li><code>-&gt;</code>, <code>-&gt;&gt;</code> 
<ul class="org-ul">
<li>Threading macros. These work like they do in Clojure. No time now to type a
description here.</li>
</ul></li>
</ul>

<p>
<b>Error Generation</b>
</p>
<ul class="org-ul">
<li><code>error (message)</code>
<ul class="org-ul">
<li>Stops execution and emits the provided error message.</li>
</ul></li>
</ul>
</div>
</div>
</div>
